[
  {
    "date": "2025-03-27",
    "location": "Mexico",
    "author": "Remi",
    "title": "Palancar Reef ",
    "content": "Today was unreal. I dove off the coast of Cozumel and finally saw the famous Palancar Reef with my own eyes. The water was so clear it felt like flying. I floated weightlessly through tunnels of coral, surrounded by schools of neon fish that shimmered like living confetti. A curious sea turtle swam alongside me for a few seconds—long enough to make me feel like I was part of its world.\n\nWe reached about 60 feet, and for a moment, everything went silent except for the sound of my breath. It was oddly calming. I saw a spotted eagle ray gliding gracefully in the distance—so effortless, like it was dancing.\n\nBack on the boat, I couldn’t stop smiling. Salt still clung to my skin, and my hair was a mess, but I felt completely alive. Mexico’s reefs are magic. Can’t wait to go back down tomorrow.\n",
    "mood": "😊",
    "rating": 4,
    "timestamp": "2025-03-27T11:00:44.561282",
    "image_path": "static/journal_images/journal_image_20250327_110044.jpg"
  },
  {
    "date": "2025-03-27",
    "location": "Belize",
    "author": "Remi",
    "title": "Belize That!",
    "content": "Today felt like a postcard I got to live in.\n\nThe air in Belize smells like salt, sun, and something sweet I can’t quite name—maybe it's just the scent of freedom. I woke up early enough to catch the sunrise melting into the Caribbean Sea, the sky brushed in pastel strokes like a watercolor painting that couldn’t quite decide between pink or orange. I stood barefoot in the sand with coffee in hand, watching as fishing boats bobbed in the distance and pelicans dove like they were showing off.\n\nWe spent the morning exploring Mayan ruins tucked deep in the jungle, swallowed by time and vines. There’s something humbling about climbing stone steps carved by hands centuries ago, especially when howler monkeys are judging you from the trees. I tried to soak in the history, but let’s be real—I was mostly soaked in sweat. Totally worth it.\n\nLunch was roadside fry jacks stuffed with eggs and beans, and I swear nothing has ever tasted better. The woman who made them winked at me and said, “Belize that, baby!” and I laughed harder than I have in days. It’s the kind of joy that bubbles up from the stomach—not the forced kind, but the real-deal belly laugh.\n\nIn the afternoon, we snorkeled in water so clear it didn’t feel real. I saw rays gliding beneath me like underwater spirits and schools of fish flickering like glitter. I even swam near a reef shark, and yeah, my heart nearly exploded, but I did it. I Belized in myself (I know, I know—bad pun, but let me have it).\n\nTonight, I’m journaling from a hammock under string lights, toes still sandy, hair full of sea salt, heart even fuller. I don’t know what it is about this place, but it cracked something open in me—in the best way.\n\nI’m not sure what comes next, but I know I’ll carry this version of me home. The version who says yes, who laughs easily, who feels alive all the way down to the bones.\n\nBelize that.\n—R.",
    "mood": "😊",
    "rating": 5,
    "timestamp": "2025-03-27T13:29:56.771123",
    "image_path": null
  },
  {
    "date": "2025-02-27",
    "location": "Puerto Rico",
    "author": "Remi",
    "title": "Vieques",
    "content": "Diving off the coast of Vieques today was like slipping into a hidden world. The water here has this unreal turquoise glow, and the reefs felt untouched—wild and alive. I followed a narrow channel between two coral walls, spotting bright parrotfish and an octopus tucked beneath a ledge, changing colors as it moved.\n\nThe visibility was incredible—at least 80 feet. I floated above a garden of sea fans swaying in sync with the current. Then came the best part: a small group of reef sharks cruising by in the distance. They didn’t seem to care I was there, just doing their thing, calm and powerful.\n\nSurface time was just as beautiful—sun warming my wetsuit, the island breeze soft and salty. There’s something about Puerto Rico that feels familiar and wild all at once. I could stay underwater forever here.",
    "mood": "😊",
    "rating": 5,
    "timestamp": "2025-03-27T13:31:51.217473",
    "image_path": "static/journal_images/journal_image_20250327_133151.jpg"
  }
]